[
  "retro",
  "oval",
  "sunglasses",
  "tapered",
  "arms",
  "neutral",
  "colored",
  "round",
  "lens",
  "53mm",
  "womens",
  "small",
  "glasses",
  "slim",
  "clear",
  "48mm",
  "high",
  "fashion",
  "bold",
  "rim",
  "classic",
  "casual",
  "frame",
  "horn",
  "rimmed",
  "47mm",
  "women's",
  "cat",
  "eye",
  "engraved",
  "nose",
  "bridge",
  "semi",
  "rimless",
  "55mm",
  "true",
  "vintage",
  "steampunk",
  "inspired",
  "unique",
  "metal",
  "60mm",
  "wide",
  "thick",
  "",
  "flat",
  "mirrored",
  "49mm",
  "90's",
  "54mm",
  "large",
  "oversize",
  "chunky",
  "premium",
  "with",
  "mirror",
  "52mm",
  "extreme",
  "transparent",
  "modern",
  "56mm",
  "detail",
  "color",
  "tinted",
  "mono",
  "green",
  "pastel",
  "thin",
  "rounded",
  "50mm",
  "temples",
  "51mm",
  "mod",
  "retro-vintage",
  "style",
  "lennon",
  "circle",
  "original",
  "standard",
  "aviator",
  "-",
  "nickel",
  "plated",
  "shape",
  "coated",
  "flash",
  "half",
  "semi-rimless",
  "optical",
  "rx",
  "matte",
  "super",
  "dark",
  "square",
  "plastic",
  "glass",
  "eyeglasses",
  "temple",
  "57mm",
  "two-toned",
  "neon",
  "lifestyle",
  "rubberized",
  "finish",
  "top",
  "keyhole",
  "curved",
  "crossbar",
  "subtle",
  "p3",
  "46mm",
  "for",
  "men",
  "women",
  "silver",
  "teardrop",
  "ultra",
  "65mm",
  "etched",
  "edge",
  "pantos",
  "ornate",
  "pattern",
  "browbar",
  "double",
  "pink",
  "58mm",
  "horned",
  "lenses",
  "brow",
  "bar",
  "cutout",
  "half-frame",
  "dapper",
  "side",
  "cover",
  "iridescent",
  "trim",
  "luxe",
  "90s",
  "medium",
  "rectangle",
  "stud",
  "accents",
  "62mm",
  "rams",
  "beveled",
  "61mm",
  "gradient",
  "accented",
  "66mm",
  "59mm",
  "accent",
  "geometric",
  "and",
  "two-tone",
  "border",
  "43mm",
  "jaguar",
  "block",
  "tortoise",
  "print",
  "arrow",
  "45mm",
  "42mm",
  "oversized",
  "rivets",
  "70mm",
  "art",
  "deco",
  "layered",
  "designer",
  "glam",
  "full",
  "63mm",
  "open",
  "handcrafted",
  "rhinestone",
  "embellished",
  "shaped",
  "w/",
  "detailed",
  "p-3",
  "prism",
  "pointed",
  "corner",
  "butterfly",
  "key",
  "hole",
  "ringed",
  "gold",
  "2-tone",
  "chic",
  "64mm",
  "colorful",
  "marble",
  "arm",
  "metallic",
  "angular",
  "riveted",
  "spiked",
  "bridged",
  "70s",
  "tint",
  "bright",
  "compact",
  "folding",
  "pocket",
  "frosted",
  "zombie",
  "monster",
  "creepy",
  "crazy",
  "bulging",
  "eyes",
  "novelty",
  "costume",
  "party",
  "cross",
  "adorned",
  "wink",
  "asymmetrical",
  "unisex",
  "modified",
  "faux",
  "wooden",
  "fab",
  "ball",
  "laser",
  "uv400",
  "protected",
  "composite",
  "printed",
  "67mm",
  "moon",
  "cut",
  "textured",
  "aviators",
  "quality",
  "big",
  "x-large",
  "69mm",
  "(nickel",
  "frame)",
  "80s",
  "blue",
  "blocking",
  "xl",
  "polarized",
  "technologic",
  "rannier",
  "shatterproof",
  "shield",
  "tr-90",
  "sports",
  "68mm",
  "41mm",
  "rectangular",
  "hd",
  "driving",
  "wrap",
  "men's",
  "american",
  "flag",
  "usa",
  "stars",
  "stripes",
  "new",
  "larger",
  "tip",
  "point",
  "44mm",
  "50's",
  "reflective",
  "&",
  "penta",
  "lightweight",
  "futuristic",
  "hexagon",
  "wraparound",
  "acetate",
  "adjustable",
  "tr90",
  "goggles",
  "strap",
  "durable",
  "aggressive",
  "material",
  "sport",
  "x-loop",
  "brand",
  "eyewear",
  "jacket",
  "xloop",
  "running",
  "cycling",
  "protective",
  "padded",
  "multisport",
  "golf/cycling",
  "ventilated",
  "yellow",
  "night",
  "sungalsses",
  "action",
  "mens",
  "rx'able",
  "tear",
  "drop",
  "diamond",
  "candy",
  "shell",
  "hip",
  "hop",
  "design",
  "black",
  "festival",
  "w",
  "/",
  "issue",
  "iconic",
  "geek",
  "nerd",
  "assorted",
  "hispter",
  "soft",
  "basic",
  "rare",
  "rivet",
  "floral",
  "vision",
  "guard",
  "anti-fog",
  "static",
  "cleaner",
  "+",
  "cloth",
  "zipper",
  "capsule",
  "sunglass",
  "case",
  "nylon",
  "chain",
  "wood",
  "hard",
  "clam",
  "snap",
  "vinyl",
  "closure",
  "\"sleek",
  "4",
  "piece",
  "quad",
  "travel",
  "6.5\"\"\"",
  "pearls",
  "decorated",
  "microfiber",
  "drawstring",
  "pouch",
  "\"chunky",
  "24\"\"",
  "link",
  "accessory\"",
  "\"color",
  "pop",
  "30\"\"",
  "translucent",
  "face",
  "mask",
  "chain\"",
  "\"fabulous",
  "glitter",
  "rainbow",
  "tri",
  "fold",
  "portable",
  "\"holo",
  "up",
  "holographic",
  "6\"\"\"",
  "repair",
  "kit",
  "mini",
  "screwdriver",
  "screws",
  "\"6.75\"\"",
  "magnetic",
  "case\"",
  "belt",
  "holder",
  "collectors",
  "edition",
  "display",
  "carrying",
  "pilot",
  "wire",
  "tearddrop",
  "spring",
  "hinges",
  "crafted",
  "around",
  "monoblock",
  "cyclops",
  "147mm",
  "limited",
  "flip-up",
  "django",
  "red",
  "heart",
  "cupid",
  "third",
  "pearl",
  "mid",
  "size",
  "old",
  "school",
  "eazy",
  "e",
  "og",
  "loc",
  "amber",
  "safety",
  "active",
  "multi-purpose",
  "riding/sports",
  "sized",
  "ideal",
  "driving/sports/bike",
  "motorcycle",
  "biker",
  "frameless",
  "|",
  "riding",
  "safety/active/sports",
  "goggle",
  "snow",
  "ski",
  "mx",
  "safty",
  "vents",
  "out",
  "hollow",
  "cateyes",
  "criss",
  "crossed",
  "cateye",
  "perforated",
  "triple",
  "sleek",
  "in",
  "covers",
  "pyramid",
  "neutral-colored",
  "night-driving",
  "glare",
  "reducing",
  "80's",
  "urban",
  "spec",
  "die",
  "class",
  "locs",
  "white",
  "minimal",
  "inner-rimmed",
  "one",
  "pc",
  "ultra-bold",
  "hexagonal",
  "minimalist",
  "eyelid",
  "internet",
  "censorship",
  "one-piece",
  "lip",
  "princess",
  "crown",
  "pom",
  "jeweled",
  "marijuana",
  "leaf",
  "ganja",
  "bud",
  "pot",
  "weed",
  "fun",
  "peace",
  "sign",
  "70's",
  "era",
  "hippie",
  "free",
  "love",
  "woodstock",
  "daft",
  "punk",
  "official",
  "beer",
  "fest",
  "funny",
  "mardi",
  "gras",
  "happy",
  "sad",
  "smile",
  "now",
  "cry",
  "later",
  "gamer",
  "pixel",
  "amf",
  "adios",
  "cocktail",
  "favor",
  "drink",
  "celebration",
  "money",
  "dollar",
  "signs",
  "bling",
  "pimp",
  "buldging",
  "silly",
  "electric",
  "guitar",
  "rock",
  "star",
  "musician",
  "pumpkin",
  "head",
  "laughing",
  "angry",
  "halloween",
  "skull",
  "skeleton",
  "dragon",
  "claws",
  "hydra",
  "scales",
  "jester",
  "circus",
  "clown",
  "furry",
  "las",
  "vegas",
  "blackjack",
  "21",
  "cards",
  "dealer",
  "table",
  "mixed",
  "time",
  "masquerade",
  "polygon",
  "native",
  "shapes",
  "octagon",
  "goemetric",
  "skate",
  "squared",
  "watch",
  "sporty",
  "wakely",
  "ventilation",
  "holes",
  "72mm",
  "sharp",
  "spectacle",
  "exaggerated",
  "abstract",
  "stripe",
  "team",
  "basketball",
  "city",
  "85mm",
  "mid-size",
  "nepal",
  "80mm",
  "73mm",
  "75mm",
  "visor",
  "172mm",
  "adorable",
  "9",
  "inch",
  "cute",
  "flower",
  "micro",
  "three",
  "hearts",
  "beaded",
  "smoke",
  "vibrant",
  "sweet",
  "ombre",
  "details",
  "145mm",
  "mirrror",
  "intense",
  "kids",
  "outdoors",
  "light",
  "protection",
  "scalloped",
  "polygonal",
  "girls",
  "bow",
  "everyday",
  "children",
  "sparkle",
  "kitty",
  "whisker",
  "inset",
  "bottom",
  "hook",
  "hinged",
  "cut-out",
  "stylish",
  "circular",
  "artwork",
  "lightning",
  "stepped",
  "zigzag",
  "contemporary",
  "alligator",
  "bow-tie",
  "two",
  "toned",
  "titus",
  "78mm",
  "ribbed",
  "74mm",
  "77mm",
  "olympus",
  "helens",
  "1980s",
  "triangle",
  "eco-friendly",
  "real",
  "bamboo",
  "genuine",
  "ppe",
  "97mm",
  "traditional",
  "anti",
  "filter",
  "buttom",
  "vented",
  "computer",
  "gaming",
  "filtering",
  "classy",
  "strain",
  "81mm",
  "streetwear",
  "110mm",
  "studded",
  "elegance",
  "templed",
  "rhinestones",
  "rhinstone",
  "crystal",
  "shades",
  "menswear",
  "u-shaped",
  "clout",
  "nuetral",
  "71mm",
  "poolside",
  "detachable",
  "straight",
  "zerouv",
  "gangsta",
  "shiny",
  "blacked",
  "hipster",
  "flat-top",
  "bohemian",
  "bead",
  "camouflage",
  "fabric",
  "aroa",
  "thor",
  "vinson",
  "removable",
  "padding",
  "kush",
  "amazon",
  "dept",
  "patriotic",
  "g-15",
  "couture",
  "angled",
  "transluscent",
  "aesthetically",
  "elegant",
  "fire",
  "bevelled",
  "flame",
  "tone",
  "flaming",
  "flames",
  "retro-inspired",
  "button",
  "vegan",
  "leather"
]